# Generated by chezmoi. Edit the source template, not this file.

# Portable shell and command-line essentials.
brew "bat"
brew "chezmoi"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "jq"
brew "pure"
brew "ripgrep"
brew "tmux"
brew "uv"
brew "wget"
brew "zoxide"
brew "zsh"

{{- if eq .profile "dev" }}

# Development tools.
tap "anomalyco/tap"
brew "act"
brew "ast-grep"
brew "cloc"
brew "cloudflared"
{{- if eq .chezmoi.os "darwin" }}
brew "cocoapods"
{{- end }}
brew "deno"
brew "doctl"
brew "ffmpeg"
brew "gradle"
brew "herdr"
brew "httpie"
brew "imagemagick"
brew "k6"
brew "lazygit"
brew "libpq", link: true
brew "openjdk@21"
brew "pandoc"
brew "poppler"
brew "scc"
brew "sd"
brew "tokei"
brew "watchman"
brew "anomalyco/tap/opencode", trusted: true
{{- end }}

{{- if and (eq .chezmoi.os "darwin") (eq .profile "dev") }}

# macOS essentials.
cask "1password"
cask "1password-cli"
cask "ghostty"
cask "handy"
cask "font-jetbrains-mono-nerd-font"
cask "raycast"
cask "tailscale-app"
cask "zen"

cask "bruno"
cask "datagrip"
cask "paper-design"
cask "postman"

{{- if or (eq .editor "zed") (eq .editor "both") }}
cask "zed"
{{- end }}
{{- if or (eq .editor "vscode") (eq .editor "both") }}
cask "visual-studio-code"
{{- end }}

{{- if eq .container "orbstack" }}
cask "orbstack"
{{- end }}
{{- end }}

{{- if and (eq .chezmoi.os "darwin") .personal }}
brew "mas"
cask "spotify"
mas "Flow", id: 1423210932
{{- end }}
