# Generated by chezmoi. Edit the source template, not this file.

# Portable shell and command-line essentials.
brew "bat"
brew "chezmoi"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "jq"
{{- if eq .role "devbox" }}
brew "mosh"
{{- end }}
brew "pure"
brew "ripgrep"
brew "tmux"
brew "uv"
brew "wget"
brew "zoxide"
brew "zsh"

{{- if eq .profile "dev" }}

# Development tools.
tap "anomalyco/tap"
brew "act"
brew "ast-grep"
brew "bottom"
brew "btop"
brew "cloc"
brew "cloudflared"
{{- if eq .chezmoi.os "darwin" }}
brew "cocoapods"
brew "mole"
{{- end }}
brew "deno"
brew "doctl"
brew "duf"
brew "dust"
brew "fastfetch"
brew "ffmpeg"
brew "git-lfs"
brew "gradle"
brew "glow"
brew "herdr"
brew "kitlangton/tap/ghui", trusted: true
brew "modem-dev/tap/hunk", trusted: true
brew "httpie"
brew "hyperfine"
brew "imagemagick"
brew "just"
brew "k6"
brew "lazydocker"
brew "lazygit"
brew "libpq", link: true
brew "openjdk@21"
brew "pandoc"
brew "poppler"
brew "procs"
brew "scc"
brew "sd"
brew "shellcheck"
brew "shfmt"
brew "tealdeer"
brew "tokei"
brew "watchexec"
brew "watchman"
brew "yq"
brew "anomalyco/tap/opencode", trusted: true
{{- end }}

{{- if and (eq .chezmoi.os "darwin") (eq .profile "dev") (eq .role "workstation") }}

# macOS essentials.
cask "1password"
cask "1password-cli"
cask "ghostty"
cask "handy"
cask "font-jetbrains-mono-nerd-font"
cask "raycast"
cask "tailscale-app"
cask "zen"

cask "bruno"
cask "datagrip"
cask "paper-design"
cask "postman"

{{- if or (eq .editor "zed") (eq .editor "both") }}
cask "zed"
{{- end }}
{{- if or (eq .editor "vscode") (eq .editor "both") }}
cask "visual-studio-code"
{{- end }}

{{- if or (eq .container "auto") (eq .container "orbstack") }}
cask "orbstack"
{{- end }}
{{- end }}

{{- if and (eq .chezmoi.os "darwin") (eq .profile "dev") (eq .role "devbox") }}

# Headless macOS host. Tailscale and OrbStack still have app bundles, but no
# workstation applications are installed.
cask "tailscale-app"
{{- if or (eq .container "auto") (eq .container "orbstack") }}
cask "orbstack"
{{- end }}
{{- end }}

{{- if and (eq .chezmoi.os "linux") (eq .profile "dev") (eq .role "devbox") (or (eq .container "auto") (eq .container "docker")) }}

# The Docker daemon remains distro-managed; these provide portable clients.
brew "docker"
brew "docker-compose"
{{- end }}

{{- if and (eq .chezmoi.os "darwin") (eq .role "workstation") .personal }}
brew "mas"
cask "spotify"
mas "Flow", id: 1423210932
{{- end }}
